"""
Вимоги до завдання:
Функція caching_fibonacci() повинна повертати внутрішню функцію fibonacci(n).
fibonacci(n) обчислює n-те число Фібоначчі. Якщо число вже знаходиться у кеші, функція має повертати значення з кешу.
Якщо число не знаходиться у кеші, функція має обчислити його, зберегти у кеш та повернути результат.
Використання рекурсії для обчислення чисел Фібоначчі.

Критерії оцінювання:
Коректність реалізації функції fibonacci(n) з урахуванням використання кешу.
Ефективне використання рекурсії та кешування для оптимізації обчислень.
Чистота коду, включаючи читабельність та наявність коментарів.
"""


def caching_fibonacci():
    # Створити порожній словник cache
    pass

    def fibonacci(n):
        # Якщо n <= 0, повернути 0
        # Якщо n == 1, повернути 1
        # Якщо n у cache, повернути cache[n]

        # cache[n] = fibonacci(n - 1) + fibonacci(n - 2)
        # Повернути cache[n]
        pass
    return fibonacci

# КІНЕЦЬ ФУНКЦІЇ caching_fibonacci

def main():
    # Отримуємо функцію fibonacci
    fib = caching_fibonacci()

# Використовуємо функцію fibonacci для обчислення чисел Фібоначчі
    print(fib(10))  # Виведе 55
    print(fib(15))  # Виведе 610

if __name__ == "__main__":
    main()
